# ShowPreview Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FileOpenDialog..::..ShowPreview Property
FileOpenDialog Class See Also
---
Identifies if the dialog should include a region showing a preview of the selected file.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool ShowPreview { get; set; }
```

Visual Basic
---
```text
Public Property ShowPreview As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowPreview {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
The default value is false, to not show the preview area in the dialog. If set to true, note that Revit may not be able to show a preview of all possible file types.
# See Also
FileOpenDialog Class
Autodesk.Revit.UI Namespace